code-review/NRB_3471_3546/База_Было/Documents/НачисленныйНалог.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>НачисленныйНалог</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.НалоговаяБазаВыплатыДоходов</xr:Item>
				<xr:Item>AccumulationRegister.ДенежныеСредства</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Поручение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Депонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДепо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДепо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазделСчетаДепо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазделыСчетаДепо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ставка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНалога</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсВалюты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КратностьВалюты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНалогаПоСтавке15СПревышения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Документ1СИЦ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НалоговаяБаза</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоэффициентД1</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>23</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоэффициентД2</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>23</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подтвержден</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВыплаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Резидент</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаЗачетНалогаНаПрибыль</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазаДляРасчетаЗНП</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНачисленныйНалогОбычнаяСтавка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНачисленныйНалогПовышеннаяСтавка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Эмитент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаКВыплатеПоОсновнаяСтавка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаКВыплатеПоПовышеннаяСтавка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНалогаПовышенная</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаОкругленияНалога</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>7</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаИПДНалогаВИностраннойЮрисдикции</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СтавкаНалога</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаЗачетНалогаВИностраннойЮрисдикции</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНалогаСОИДН</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СтавкаНалога</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНалогаВИностраннойЮрисдикции</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкиНалогаУстановленыВРучномРежиме</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаОкругленияВыплат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>7</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/InformationRegisters/ЮридическиеЛицаМеждународныеКомпании.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЮридическиеЛицаМеждународныеКомпании</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>МеждународнаяКомпания</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПризнакРегистрацииМеждународнойКомпании</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПризнакРегистрацииМеждународнойКомпании</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>210</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЮридическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮридическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/InformationRegisters/СоглашенияОбИзбежанииДвойногоНалогообложения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СоглашенияОбИзбежанииДвойногоНалогообложения</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтавкаПоРеализации</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СтавкаНалога</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтавкаПоКупонам</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СтавкаНалога</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтавкаПоДивидендам</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СтавкаНалога</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтавкаПоИнымДоходам</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СтавкаНалога</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФлагАктивности</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>210</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Страна</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторСтранМира</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/AccumulationRegisters/НалоговаяБазаВыплатыДоходов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>НалоговаяБазаВыплатыДоходов</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаДохода</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаДоходаВВалюте</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРасхода</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНалога</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНалогаСПревышения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗачетНалогаНаПрибыль</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗачетНалогаВИностраннойЮрисдикции</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаКВыплатеПоОсновнаяСтавка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаКВыплатеПоПовышеннаяСтавка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаОкругленияНалога</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>7</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Депонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодДохода</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоходыНДФЛ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЮридическиеФизическиеЛица</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮридическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/Documents/НачисленныйНалог/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Возвращает Истина, если на дату проверки включен расчет НДФЛ по прогрессивной шкале, иначе Ложь.
//
// Параметры:
//  ДатаПроверки - Дата - Дата и время
// 
// Возвращаемое значение:
//  Булево - Статус расчета по прогрессивной шкале
//
Функция ИспользоватьРасчетНДФЛПоПрогрессивнойШкале(ДатаПроверки) Экспорт
	
	ДатаВвода = ОбщегоНазначенияПовтИсп.ЗначениеКонстанты("ДатаВводаРасчетаНДФЛПоПрогрессивнойШкале");
	
	Статус = ЗначениеЗаполнено(ДатаВвода) И ДатаПроверки >= ДатаВвода;
	
	Возврат Статус;
	
КонецФункции

// Функция - Неподтвержденные документы начисления НДФЛПо дивидендам
//
// Параметры:
//  Поручение		 - ДокументСсылка.Поручение - Поручение
//  НачисленныйНалог - ДокументСсылка.НачисленныйНалог - НачисленныйНалог
// 
// Возвращаемое значение:
//   - Булево - Есть ли неподтвержденные документы начисления НДФЛ по дивидендам
//
Функция НеподтвержденныеДокументыНачисленияНДФЛПоДивидендам(Поручение, НачисленныйНалог = Неопределено) Экспорт
	
	НеобходимРасчетНалога = Документы.НачисленныйНалог.РасчетНалогаРазрешен(Поручение.ВидОперацииД);
	
	Если НеобходимРасчетНалога = Ложь Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НачисленныйНалог.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.НачисленныйНалог КАК НачисленныйНалог
	|ГДЕ
	|	НачисленныйНалог.Основание = &Основание
	|	И НЕ НачисленныйНалог.Ссылка = &НачисленныйНалог
	|	И НЕ НачисленныйНалог.ПометкаУдаления
	|	И НЕ НачисленныйНалог.Подтвержден";
	Запрос.УстановитьПараметр("Основание", Поручение);
	Запрос.УстановитьПараметр("НачисленныйНалог", НачисленныйНалог);
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

// Возвращает Код дохода по виду операции
//
// Параметры:
//  ВидОперации	 - СправочникСсылка.ВидыОпераций - Вид операции поручения
// 
// Возвращаемое значение:
//   - СправочникСсылка.ДоходыНДФЛ - Код дохода
//
Функция КодДоходаПоВидуОперации(ВидОперации) Экспорт
	
	ПустойКодДохода = Справочники.ДоходыНДФЛ.ПустаяСсылка();
	Если ТипЗнч(ВидОперации) = Тип("СправочникСсылка.ВидыОпераций") Тогда
		Если ВидОперации = Справочники.ВидыОпераций.НачислениеДивидендов Тогда
				КодДохода = Справочники.ДоходыНДФЛ.Код1010;
		ИначеЕсли ВидОперации = Справочники.ВидыОпераций.ПогашениеНКД
			Или ВидОперации = Справочники.ВидыОпераций.Выкуп Тогда
				КодДохода = Справочники.ДоходыНДФЛ.Код1530;
		Иначе
				КодДохода = ПустойКодДохода;
		КонецЕсли;
	Иначе
				КодДохода = ПустойКодДохода;
	КонецЕсли;
	
	Возврат КодДохода;
	
КонецФункции

// Возвращает признак разрешения начисления налога по виду операции
//
// Параметры:
//  ВидОперации	 - СправочникСсылка.ВидыОпераций - Вид операции поручения
// 
// Возвращаемое значение:
//   - Булево - Расчет налога разрешен
//
Функция РасчетНалогаРазрешен(ВидОперации) Экспорт
	КодДохода = Документы.НачисленныйНалог.КодДоходаПоВидуОперации(ВидОперации);
	РазрешенНалог1010 = КодДохода = Справочники.ДоходыНДФЛ.Код1010
		И ОбщегоНазначенияПовтИсп.ЗначениеКонстанты("РасчетНалогаПоДивидендамВСистеме");
	РазрешенНалог1530 = КодДохода = Справочники.ДоходыНДФЛ.Код1530
		И ОбщегоНазначенияПовтИсп.ЗначениеКонстанты("РасчетНалогаПоКупонамВСистеме");
	Возврат РазрешенНалог1010 Или РазрешенНалог1530;
КонецФункции

// Возвращает рассчитанный налог
//
// Параметры:
//  ДокументНачисления	 - ДокументОбъект.НачисленныйНалог,ДокументСсылка.НачисленныйНалог	 - Документ начисления налога
//  						с реквизитами "Основание, Дата, Депонент, Эмитент, Резидент, СуммаВыплаты, КоэффициентД2, КоэффициентД1"
// 
// Возвращаемое значение:
//   - Структура- Реквизиты начисления налога
//  	* Ставка - Число - Ставка
//  	* НалоговаяБаза - Число - Налоговая база
//  	* СтавкаНалогаПовышенная - Число - Ставка Повышенная
//  	* БазаДляРасчетаЗНП - Число - База для расчета ЗНП
//  	* СуммаЗачетНалогаНаПрибыль - Число - Зачет налога на прибыль
//  	* СуммаНачисленныйНалогОбычнаяСтавка - Число - Налог начислен
//  	* СуммаНалога - Число - Налог к оплате
//  	* СуммаНачисленныйНалогПовышеннаяСтавка - Число - Налог начислен по Повышенная Ставка
//  	* СуммаНалогаПоСтавке15СПревышения - Число - Налог к оплате Повышенная Ставка
//  	* СуммаКВыплатеПоОсновнаяСтавка - Число - Сумма к выплате по Основная Ставка
//  	* СуммаКВыплатеПоПовышеннаяСтавка - Число - Сумма к выплате по Повышенная Ставка
//  	* СуммаОкругленияНалога - Число - Сумма округления налога (накопительно)
//
Функция РассчитанныйНалог(ДокументНачисления) Экспорт
	
	СтоПроцентов		 = 100;
	СтавкаЗНП			 = 13;
	ВидОперации			 = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументНачисления.Основание, "ВидОперацииД");
	ВидЦББанкаРоссии	 = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументНачисления.Основание.ЦБ, "ВидЦББанкаРоссии");
	ЭтоВидИностраннойЦБ	 = Справочники.ВидыЦББанкаРоссии.ЭтоВидИностраннойЦБ(ВидЦББанкаРоссии);
	ЭтоВыплатаДоходаПоАкциямИлиИнымЦБ = Справочники.ВидыОпераций.ЭтоВыплатаДоходаПоАкциямИлиИнымЦБ(ВидОперации);
	Эмитент 			 = ДокументНачисления.Эмитент;
	ЭтоМК = РегистрыСведений.ЮридическиеЛицаМеждународныеКомпании.ЭтоМК(ДокументНачисления.Дата, Эмитент.ЮридическиеФизическиеЛица);
	ЭтоНалогВИностраннойЮрисдикции = ЭтоВидИностраннойЦБ И ЭтоВыплатаДоходаПоАкциямИлиИнымЦБ И Не ЭтоМК;

	КодДохода			 = Документы.НачисленныйНалог.КодДоходаПоВидуОперации(ВидОперации);
	ЭтоДепонентФизЛицо	 = ДокументНачисления.Депонент.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо;

	Если ДокументНачисления.СтавкиНалогаУстановленыВРучномРежиме Тогда
		Ставка = ДокументНачисления.Ставка;
	ИначеЕсли ЭтоДепонентФизЛицо И Не ДокументНачисления.Резидент И ЭтоМК Тогда
		Ставка = 5;
	Иначе
		Ставка = Справочники.ДоходыНДФЛ.ПолучитьАктуальнуюСтавку(КодДохода, ДокументНачисления.Резидент, ЭтоДепонентФизЛицо);
	КонецЕсли;
	
	// Определяем курс валюты
	ПараметрыКурсаВалюты = ОбщегоНазначения.ПолучитьКурсВалюты(ДокументНачисления.Валюта, ДокументНачисления.Дата);
	Курс = ?(ЗначениеЗаполнено(ПараметрыКурсаВалюты.Курс), ПараметрыКурсаВалюты.Курс, 1);
	Кратность = ?(ЗначениеЗаполнено(ПараметрыКурсаВалюты.Кратность), ПараметрыКурсаВалюты.Кратность, 1);
	КурсВал = Курс / Кратность;
	
	// Определяем СОИДН
	Страна = Справочники.КлассификаторСтранМира.СтранаЭмитента(Эмитент);
	СтавкиСОИДН = РегистрыСведений.СоглашенияОбИзбежанииДвойногоНалогообложения.ДействующиеНалоговыеСтавки(ДокументНачисления.Дата, Страна);
	СтавкаНалогаСОИДН = РегистрыСведений.СоглашенияОбИзбежанииДвойногоНалогообложения.СтавкаПоВидуОперации(ВидОперации, СтавкиСОИДН);
	
	// Считаем суммы выплаты по обычной и повышенной ставке
	НалоговаяБаза =
		РегистрыНакопления.НалоговаяБазаВыплатыДоходов.НалоговаяБазаЗаПериод(ДокументНачисления.Депонент,
			КодДохода, ДокументНачисления.МоментВремени());
	СуммаВыплатыПоОбычнойСтавке = 0;
	СтавкаНалогаПовышенная = 0;
	ЧисловыеПараметрыРасчета = Новый Структура("НалоговаяБаза, КурсВал, Ставка", НалоговаяБаза, КурсВал, Ставка);
	РассчитатьСуммуВыплатыПоОбычнойСтавкеИПовышеннуюСтавку(ДокументНачисления, ЭтоДепонентФизЛицо, КодДохода, ЧисловыеПараметрыРасчета,
		СуммаВыплатыПоОбычнойСтавке, СтавкаНалогаПовышенная);
	СуммаВыплатыПоПовышеннойСтавке = ДокументНачисления.СуммаВыплаты - СуммаВыплатыПоОбычнойСтавке;
	
	// Считаем ЗНП
	НулеваяБазаДляРасчетаЗНП =
		КодДохода = Справочники.ДоходыНДФЛ.Код1530 Или Не ДокументНачисления.Резидент Или ДокументНачисления.КоэффициентД1 = 0;
	Если НулеваяБазаДляРасчетаЗНП Тогда
		БазаДляРасчетаЗНП = 0;
	Иначе
		БазаДляРасчетаЗНП =
			Мин(ДокументНачисления.КоэффициентД2 / ДокументНачисления.КоэффициентД1
					* ДокументНачисления.СуммаВыплаты * КурсВал, ДокументНачисления.СуммаВыплаты * КурсВал);
		БазаДляРасчетаЗНПРазрядность =
			Метаданные.Документы.НачисленныйНалог.Реквизиты.БазаДляРасчетаЗНП.Тип.КвалификаторыЧисла.РазрядностьДробнойЧасти;
		БазаДляРасчетаЗНП = Окр(БазаДляРасчетаЗНП, БазаДляРасчетаЗНПРазрядность);
	КонецЕсли;
	СуммаЗачетНалогаНаПрибыль = Окр(БазаДляРасчетаЗНП * СтавкаЗНП / СтоПроцентов);
	
	// Считаем зачет налога в иностранной юрисдикции
	СуммаНалогаНачисленнаяПоСтавкамСОИДН = Окр(ДокументНачисления.СуммаВыплаты * КурсВал * СтавкаНалогаСОИДН / СтоПроцентов); 
	СуммаИПДНалогаВИностраннойЮрисдикции = Окр(ДокументНачисления.СуммаНалогаВИностраннойЮрисдикции * КурсВал);
	СуммаЗачетНалогаВИностраннойЮрисдикции = Мин(СуммаНалогаНачисленнаяПоСтавкамСОИДН, СуммаИПДНалогаВИностраннойЮрисдикции);
	
	СуммаВЗачетНалога = СуммаЗачетНалогаНаПрибыль + СуммаЗачетНалогаВИностраннойЮрисдикции;
	// Получаем накопленные округления
	СуммаОкругленияНалога = РегистрыНакопления.НалоговаяБазаВыплатыДоходов.СуммаОстаткаОкругленияНалогаЗаПериод(
		ДокументНачисления.Депонент, КодДохода, ДокументНачисления.МоментВремени());
	СуммаОкругленияНалогаРазрядность =
		Метаданные.Документы.НачисленныйНалог.Реквизиты.СуммаОкругленияНалога.Тип.КвалификаторыЧисла.РазрядностьДробнойЧасти;
	
	// Считаем Налог по обычной ставке за вычетом Зачета налога
	СуммаНачисленныйНалогОбычнаяСтавкаБезОкруглений	 = СуммаВыплатыПоОбычнойСтавке * КурсВал * Ставка / СтоПроцентов + СуммаОкругленияНалога;
	СуммаНачисленныйНалогОбычнаяСтавка				 = Окр(СуммаНачисленныйНалогОбычнаяСтавкаБезОкруглений);
	СуммаОкругленияНалогаБезОкруглений				 = СуммаНачисленныйНалогОбычнаяСтавкаБезОкруглений - СуммаНачисленныйНалогОбычнаяСтавка;
	СуммаОкругленияНалога							 = Окр(СуммаОкругленияНалогаБезОкруглений, СуммаОкругленияНалогаРазрядность);
	Если СуммаНачисленныйНалогОбычнаяСтавка <= СуммаВЗачетНалога Тогда
		СуммаНалога = 0;
	Иначе
		СуммаНалога = СуммаНачисленныйНалогОбычнаяСтавка - СуммаВЗачетНалога;
	КонецЕсли;
	
	// Считаем налог по повышенной ставке за вычетом остатка Зачета налога
	СуммаНачисленныйНалогПовышеннаяСтавкаБезОкруглений
													 = СуммаВыплатыПоПовышеннойСтавке * КурсВал * СтавкаНалогаПовышенная / СтоПроцентов + СуммаОкругленияНалога;
	СуммаНачисленныйНалогПовышеннаяСтавка			 = Окр(СуммаНачисленныйНалогПовышеннаяСтавкаБезОкруглений);
	СуммаОкругленияНалогаБезОкруглений				 = СуммаНачисленныйНалогПовышеннаяСтавкаБезОкруглений - СуммаНачисленныйНалогПовышеннаяСтавка;
	СуммаОкругленияНалога							 = Окр(СуммаОкругленияНалогаБезОкруглений, СуммаОкругленияНалогаРазрядность);
	ОстатокЗачетаНалога = ?(СуммаНалога = 0, СуммаВЗачетНалога - СуммаНачисленныйНалогОбычнаяСтавка, 0);
	Если СуммаНачисленныйНалогПовышеннаяСтавка <= ОстатокЗачетаНалога Тогда
		СуммаНалогаПоСтавке15СПревышения = 0;
	Иначе
		СуммаНалогаПоСтавке15СПревышения = СуммаНачисленныйНалогПовышеннаяСтавка - ОстатокЗачетаНалога;
	КонецЕсли;
	
	// Считаем суммы выплаты
	ЧисловыеПараметрыРасчета.Вставить("СуммаВыплатыПоОбычнойСтавке", СуммаВыплатыПоОбычнойСтавке);
	ЧисловыеПараметрыРасчета.Вставить("СуммаВыплатыПоПовышеннойСтавке", СуммаВыплатыПоПовышеннойСтавке);
	ЧисловыеПараметрыРасчета.Вставить("СуммаНалога", СуммаНалога);
	ЧисловыеПараметрыРасчета.Вставить("СуммаНалогаПоСтавке15СПревышения", СуммаНалогаПоСтавке15СПревышения);
	СуммаКВыплатеПоОсновнаяСтавкаБезОкруглений = 0;
	СуммаКВыплатеПоПовышеннаяСтавкаБезОкруглений = 0;
	
	РассчитатьСуммыВыплат(ДокументНачисления, ЧисловыеПараметрыРасчета, ЭтоНалогВИностраннойЮрисдикции,
		СуммаКВыплатеПоОсновнаяСтавкаБезОкруглений, СуммаКВыплатеПоПовышеннаяСтавкаБезОкруглений);
	СуммаКВыплатеПоОсновнаяСтавка				 = Окр(СуммаКВыплатеПоОсновнаяСтавкаБезОкруглений, 2);
	СуммаКВыплатеПоПовышеннаяСтавка				 = Окр(СуммаКВыплатеПоПовышеннаяСтавкаБезОкруглений, 2);
	
	СуммаОкругленияВыплатРазрядность =
		Метаданные.Документы.НачисленныйНалог.Реквизиты.СуммаОкругленияВыплат.Тип.КвалификаторыЧисла.РазрядностьДробнойЧасти;
	СуммаОкругленияВыплатБезОкруглений = (СуммаКВыплатеПоОсновнаяСтавка - СуммаКВыплатеПоОсновнаяСтавкаБезОкруглений)
		+ (СуммаКВыплатеПоПовышеннаяСтавка - СуммаКВыплатеПоПовышеннаяСтавкаБезОкруглений);
	СуммаОкругленияВыплат = Окр(СуммаОкругленияВыплатБезОкруглений, СуммаОкругленияВыплатРазрядность);
	
	// Возвращаем данные
	Результат = Новый Структура;
	Результат.Вставить("Ставка",								 Ставка);
	Результат.Вставить("НалоговаяБаза",							 НалоговаяБаза);
	Результат.Вставить("СтавкаНалогаПовышенная",				 СтавкаНалогаПовышенная);
	Результат.Вставить("БазаДляРасчетаЗНП",						 БазаДляРасчетаЗНП);
	Результат.Вставить("СуммаЗачетНалогаНаПрибыль",				 СуммаЗачетНалогаНаПрибыль);
	Результат.Вставить("СуммаНачисленныйНалогОбычнаяСтавка",	 СуммаНачисленныйНалогОбычнаяСтавка);
	Результат.Вставить("СуммаНалога",							 СуммаНалога);
	Результат.Вставить("СуммаНачисленныйНалогПовышеннаяСтавка",	 СуммаНачисленныйНалогПовышеннаяСтавка);
	Результат.Вставить("СуммаНалогаПоСтавке15СПревышения",		 СуммаНалогаПоСтавке15СПревышения);
	Результат.Вставить("СуммаКВыплатеПоОсновнаяСтавка",			 СуммаКВыплатеПоОсновнаяСтавка);
	Результат.Вставить("СуммаКВыплатеПоПовышеннаяСтавка",		 СуммаКВыплатеПоПовышеннаяСтавка);
	Результат.Вставить("СуммаОкругленияНалога",					 СуммаОкругленияНалога);
	Результат.Вставить("КурсВалюты",							 Курс);
	Результат.Вставить("КратностьВалюты",						 Кратность);
	Результат.Вставить("СтавкаНалогаСОИДН",						 СтавкаНалогаСОИДН);
	Результат.Вставить("СуммаЗачетНалогаВИностраннойЮрисдикции", СуммаЗачетНалогаВИностраннойЮрисдикции);
	Результат.Вставить("СуммаОкругленияВыплат",					 СуммаОкругленияВыплат);
	Возврат Результат;
	
КонецФункции

// Возвращает информацию о корректности расчета налога
//
// Параметры:
//  ДокументНачисления		 - ДокументСсылка.НачисленныйНалог	 - Документ начисления налога
//  	с реквизитами "Основание, Дата, Депонент, Эмитент, Резидент, СуммаВыплаты, КоэффициентД2, КоэффициентД1"
//  ТекущиеДанныеДокумента	 - Произвольный						 - Структура (см. РассчитанныйНалог)
// 
// Возвращаемое значение:
//   - Строка - HTML строка содержащая информацию о расхождениях в расчете налога
//
Функция ИнформацияОКорректностиРасчетаНалога(ДокументНачисления, ТекущиеДанныеДокумента) Экспорт
	
	СтруктураНалога = РассчитанныйНалог(ДокументНачисления);
	Расхождения = Новый ТаблицаЗначений;
	Расхождения.Колонки.Добавить("ИмяПоля", ОбщегоНазначения.ОписаниеТипаСтрока(100));
	Расхождения.Колонки.Добавить("Сейчас", ОбщегоНазначения.ОписаниеТипаЧисло(23, 7));
	Расхождения.Колонки.Добавить("Будет", ОбщегоНазначения.ОписаниеТипаЧисло(23, 7));
	Для Каждого Элемент Из СтруктураНалога Цикл
		ТекущееЗначение = ТекущиеДанныеДокумента[Элемент.Ключ];
		БудущееЗначение = Элемент.Значение;
		Если ТекущееЗначение <> Элемент.Значение Тогда
			НовоеРасхождение = Расхождения.Добавить();
			НовоеРасхождение.ИмяПоля = Элемент.Ключ;
			НовоеРасхождение.Сейчас = ТекущееЗначение;
			НовоеРасхождение.Будет = БудущееЗначение;
		КонецЕсли;
	КонецЦикла;
	
	ТекстHTML = "";
	Если Расхождения.Количество() > 0 Тогда
		ПараметрыТрансформацииВHTML = Новый Структура;
		ПараметрыТрансформацииВHTML.Вставить("ПунктПорядкуИспользуется", Истина);
		ПараметрыТрансформацииВHTML.Вставить("ШиринаТаблицы", "800");
		ПараметрыТрансформацииВHTML.Вставить("Ширина1", "320");
		ПараметрыТрансформацииВHTML.Вставить("Ширина2", "200");
		ПараметрыТрансформацииВHTML.Вставить("Ширина3", "200");
		ПараметрыТрансформацииВHTML.Вставить("ЦветШапки", "eadbaf");
		ПараметрыТрансформацииВHTML.Вставить("Заголовок1", "Имя значения расхождения");
		ПараметрыТрансформацииВHTML.Вставить("Заголовок2", "Сейчас в документе");
		ПараметрыТрансформацииВHTML.Вставить("Заголовок3", "Станет после пересчета");
		ПараметрыТрансформацииВHTML.Вставить("Положение2", "right");
		ПараметрыТрансформацииВHTML.Вставить("Положение3", "right");
		ТаблицаHTML = ОбщегоНазначения.ТаблицаЗначенийВТаблицуHTML(Расхождения, ПараметрыТрансформацииВHTML);
		ТекстHTML = "<html><BODY>";
		ТекстHTML = ТекстHTML + ТаблицаHTML;
		ТекстHTML = ТекстHTML + "</BODY></html>";
	КонецЕсли;
	
	Возврат ТекстHTML;
	
КонецФункции

// Возвращает неподтвержденные налоги до текущего налога или подтвержденные после по паре ЮридическиеФизическиеЛица \ КодДохода
//
// Параметры:
//  ДокументНачисления		 - ДокументСсылка.НачисленныйНалог	 - Документ начисления налога
//  ОписаниеВремениСобытия	 - Строка							 - "НеподтвержденныеДо" или "ПодтвержденныеПосле"
// 
// Возвращаемое значение:
//   - ТаблицаЗначений - Таблица начисленных неподтвержденных налогов с колонкой "НачисленныйНалог"
//
Функция НалогиНеподтвержденныеДоИлиПодтвержденныеПосле(ДокументНачисления, ОписаниеВремениСобытия) Экспорт
	
	НеподтвержденныеНалоги = Новый ТаблицаЗначений;
	НеподтвержденныеНалоги.Колонки.Добавить("НачисленныйНалог", Новый ОписаниеТипов("ДокументСсылка.НачисленныйНалог"));
	Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументНачисления,
		Новый Структура("ЮридическиеФизическиеЛица, ВидОперации", "СчетДепо.Владелец.ЮридическиеФизическиеЛица", "Основание.ВидОперацииД"));
	КодДохода = КодДоходаПоВидуОперации(Реквизиты.ВидОперации);
	МоментВремени = ДокументНачисления.МоментВремени();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НалоговаяБазаВыплатыДоходовОбороты.Регистратор КАК НачисленныйНеподтвержденныйНалог
	|ИЗ
	|	РегистрНакопления.НалоговаяБазаВыплатыДоходов.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Регистратор,
	|			ЮридическиеФизическиеЛица = &ЮридическиеФизическиеЛица
	|				И ВЫБОР
	|					КОГДА &ПоВсемДоходам
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ КодДохода = &КодДохода
	|				КОНЕЦ) КАК НалоговаяБазаВыплатыДоходовОбороты
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &Подтверждение
	|				ТОГДА НалоговаяБазаВыплатыДоходовОбороты.Регистратор.Подтвержден
	|			ИНАЧЕ НЕ НалоговаяБазаВыплатыДоходовОбороты.Регистратор.Подтвержден
	|		КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	НалоговаяБазаВыплатыДоходовОбороты.Период";
	
	Запрос.УстановитьПараметр("ЮридическиеФизическиеЛица"	, Реквизиты.ЮридическиеФизическиеЛица);
	Запрос.УстановитьПараметр("ПоВсемДоходам"				, КодДохода = Неопределено);
	Запрос.УстановитьПараметр("КодДохода"					, КодДохода);
	Если ОписаниеВремениСобытия = "ПодтвержденныеПосле" Тогда
		Запрос.УстановитьПараметр("Подтверждение"				, Истина);
		Запрос.УстановитьПараметр("НачалоПериода"				, Новый Граница(МоментВремени, ВидГраницы.Исключая));
		Запрос.УстановитьПараметр("КонецПериода"				, КонецГода(МоментВремени.Дата));
	Иначе
		Запрос.УстановитьПараметр("Подтверждение"				, Ложь);
		Запрос.УстановитьПараметр("НачалоПериода"				, НачалоГода(МоментВремени.Дата));
		Запрос.УстановитьПараметр("КонецПериода"				, Новый Граница(МоментВремени, ВидГраницы.Исключая));
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			НовыйНеподтвержденныйНалог = НеподтвержденныеНалоги.Добавить();
			НовыйНеподтвержденныйНалог.НачисленныйНалог = ВыборкаДетальныеЗаписи.НачисленныйНеподтвержденныйНалог;
		КонецЦикла;
	КонецЕсли;
	
	Возврат НеподтвержденныеНалоги;
	
КонецФункции

// Возвращает информацию о ранее неподтвержденных налогах
//
// Параметры:
//  ДокументНачисления	 - ДокументСсылка.НачисленныйНалог	 - Документ начисления налога
// 
// Возвращаемое значение:
//   - Строка - HTML строка содержащая информацию о ранее неподтвержденных налогах
//
Функция ИнформацияОРанееНеподтвержденныхНалогах(ДокументНачисления) Экспорт
	
	НеподтвержденныеНалоги = НалогиНеподтвержденныеДоИлиПодтвержденныеПосле(ДокументНачисления, "НеподтвержденныеДо");
	ТекстHTML = ИнформацияОНалогах(НеподтвержденныеНалоги, "Документ, подтверждение которого требуется");
	
	Возврат ТекстHTML;
	
КонецФункции

// Возвращает информацию о наличии подтвержденных налогов позже текущего налога
//
// Параметры:
//  ДокументНачисления	 - ДокументСсылка.НачисленныйНалог	 - Документ начисления налога
// 
// Возвращаемое значение:
//   - Строка - HTML строка содержащая информацию о подтвержденных налогах позже текущего
//
Функция ИнформацияОПодтвержденныхНалогахПозжеТекущего(ДокументНачисления) Экспорт
	
	ПодтвержденныеНалоги = НалогиНеподтвержденныеДоИлиПодтвержденныеПосле(ДокументНачисления, "ПодтвержденныеПосле");
	ТекстHTML = ИнформацияОНалогах(ПодтвержденныеНалоги, "Документ, подтвержденный после текущего");
	
	Возврат ТекстHTML;
	
КонецФункции

// Возвращает комментарий о налоге удержанном в иностранной юрисдикции
//
// Параметры:
//  СуммаНалогаВИностраннойЮрисдикции	 - Число - Сумма налога
//  ВалютаНалога						 - СправочникСсылка.Валюты	 - Валюта налога
//  СтавкаНалогаВИностраннойЮрисдикции	 - Число					 - Ставка налога (в процентах)
// 
// Возвращаемое значение:
//   - Строка - Текст комментария
//
Функция КомментарийОНалогеУдержанномВИностраннойЮрисдикции(СуммаНалогаВИностраннойЮрисдикции, ВалютаНалога,
	СтавкаНалогаВИностраннойЮрисдикции) Экспорт
	
	Комментарий = "";
	Если СуммаНалогаВИностраннойЮрисдикции > 0 Тогда
		ШаблонКомментарияОНалоге = "Сумма налога, удержанного в иностранной юрисдикции = %1 %2, ставка налога = %3%%.";
		Комментарий = СтрШаблон(ШаблонКомментарияОНалоге,
			СуммаНалогаВИностраннойЮрисдикции,
			ВалютаНалога,
			СтавкаНалогаВИностраннойЮрисдикции);
	КонецЕсли;
	
	Возврат Комментарий;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура РассчитатьСуммыВыплат(ДокументНачисления, ЧисловыеПараметрыРасчета, ЭтоНалогВИностраннойЮрисдикции,
	СуммаКВыплатеПоОсновнаяСтавкаБезОкруглений, СуммаКВыплатеПоПовышеннаяСтавкаБезОкруглений)
	
	СуммаВыплатыПоОбычнойСтавке		 = ЧисловыеПараметрыРасчета.СуммаВыплатыПоОбычнойСтавке;
	СуммаВыплатыПоПовышеннойСтавке	 = ЧисловыеПараметрыРасчета.СуммаВыплатыПоПовышеннойСтавке;
	КурсВал							 = ЧисловыеПараметрыРасчета.КурсВал;
	СуммаНалога						 = ЧисловыеПараметрыРасчета.СуммаНалога;
	СуммаНалогаПоСтавке15СПревышения = ЧисловыеПараметрыРасчета.СуммаНалогаПоСтавке15СПревышения;
	
	Если ЭтоНалогВИностраннойЮрисдикции Тогда
		КоэффициентыРаспределения = Новый Массив;
		КоэффициентыРаспределения.Добавить(СуммаВыплатыПоОбычнойСтавке);
		КоэффициентыРаспределения.Добавить(СуммаВыплатыПоПовышеннойСтавке);
		ИтогиРаспределенияНалогаИностраннойЮрисдикции =
			ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(ДокументНачисления.СуммаНалогаВИностраннойЮрисдикции,
				КоэффициентыРаспределения);
		Если ИтогиРаспределенияНалогаИностраннойЮрисдикции <> Неопределено Тогда
			КорректировкаВыплатыПоОбычнойСтавке = ИтогиРаспределенияНалогаИностраннойЮрисдикции[0];
			КорректировкаВыплатыПоПовышеннойСтавке = ИтогиРаспределенияНалогаИностраннойЮрисдикции[1];
		Иначе
			КорректировкаВыплатыПоОбычнойСтавке = 0;
			КорректировкаВыплатыПоПовышеннойСтавке = 0;
		КонецЕсли;
		СуммаКВыплатеПоОсновнаяСтавкаБезОкруглений	 = СуммаВыплатыПоОбычнойСтавке - КорректировкаВыплатыПоОбычнойСтавке;
		СуммаКВыплатеПоПовышеннаяСтавкаБезОкруглений = СуммаВыплатыПоПовышеннойСтавке - КорректировкаВыплатыПоПовышеннойСтавке;
	Иначе
		СуммаКВыплатеПоОсновнаяСтавкаБезОкруглений	 = СуммаВыплатыПоОбычнойСтавке - СуммаНалога / КурсВал;
		СуммаКВыплатеПоПовышеннаяСтавкаБезОкруглений = СуммаВыплатыПоПовышеннойСтавке - СуммаНалогаПоСтавке15СПревышения / КурсВал;
	КонецЕсли;
	
КонецПроцедуры

Процедура РассчитатьСуммуВыплатыПоОбычнойСтавкеИПовышеннуюСтавку(ДокументНачисления,
	ЭтоДепонентФизЛицо, КодДохода, ЧисловыеПараметрыРасчета,
	СуммаВыплатыПоОбычнойСтавке, СтавкаНалогаПовышенная)
	
	НалоговаяБаза = ЧисловыеПараметрыРасчета.НалоговаяБаза;
	КурсВал = ЧисловыеПараметрыРасчета.КурсВал;
	СтавкаНалогаОбычная = ЧисловыеПараметрыРасчета.Ставка;
	МаксСуммаДоходаПоОбычнойСтавке = РегистрыСведений.ЛимитыПримененияСтавокНДФЛ.ЛимитНаДату(ДокументНачисления.Дата,
		Перечисления.НДФЛСтавки.Ставка13);
	Если ДокументНачисления.Резидент И ЭтоДепонентФизЛицо Тогда
		Если ДокументНачисления.СтавкиНалогаУстановленыВРучномРежиме Тогда
			СтавкаНалогаПовышенная = ДокументНачисления.СтавкаНалогаПовышенная;
		Иначе
			СтавкаНалогаПовышенная = КодДохода.РазмерПовышеннойСтавкиРезидента;
		КонецЕсли;
		Если СтавкаНалогаОбычная = СтавкаНалогаПовышенная Тогда
			СуммаВыплатыПоОбычнойСтавкеБезОкруглений = ДокументНачисления.СуммаВыплаты;
		Иначе
			СуммаВыплатыПоОбычнойСтавкеБезОкруглений =
				Мин(Макс(МаксСуммаДоходаПоОбычнойСтавке - НалоговаяБаза, 0) / КурсВал, ДокументНачисления.СуммаВыплаты);
		КонецЕсли;
		СуммаВыплатыПоОбычнойСтавке = Окр(СуммаВыплатыПоОбычнойСтавкеБезОкруглений, 2);
	Иначе
		Если ДокументНачисления.СтавкиНалогаУстановленыВРучномРежиме Тогда
			СтавкаНалогаПовышенная = ДокументНачисления.СтавкаНалогаПовышенная;
		Иначе
			СтавкаНалогаПовышенная = 0;
		КонецЕсли;
		СуммаВыплатыПоОбычнойСтавке = ДокументНачисления.СуммаВыплаты;
	КонецЕсли;
	
КонецПроцедуры

Функция ИнформацияОНалогах(Налоги, НазваниеВидаВремени)
	
	ТекстHTML = "";
	Если Налоги.Количество() > 0 Тогда
		ПараметрыТрансформацииВHTML = Новый Структура;
		ПараметрыТрансформацииВHTML.Вставить("ПунктПорядкуИспользуется", Истина);
		ПараметрыТрансформацииВHTML.Вставить("ШиринаТаблицы", "800");
		ПараметрыТрансформацииВHTML.Вставить("Ширина1", "720");
		ПараметрыТрансформацииВHTML.Вставить("ЦветШапки", "eadbaf");
		ПараметрыТрансформацииВHTML.Вставить("Заголовок1", НазваниеВидаВремени);
		ТаблицаHTML = ОбщегоНазначения.ТаблицаЗначенийВТаблицуHTML(Налоги, ПараметрыТрансформацииВHTML);
		ТекстHTML = "<html><BODY>";
		ТекстHTML = ТекстHTML + ТаблицаHTML;
		ТекстHTML = ТекстHTML + "</BODY></html>";
	КонецЕсли;
	
	Возврат ТекстHTML;
	
КонецФункции

#КонецОбласти
